app/views/projects/index.html.erb

SELECT "projects".* FROM "projects" WHERE (projects.status <> 9) ORDER BY lft
---
  <td class="name"><span><%= link_to_project(project, {}, :title => project.short_description) %></span></td>
  <% view_project = Project.find(project)%>