app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE (projects.status <> 9) ORDER BY lft
---
          scope = scope.active
        end
        unless params[:priority] || params[:type] || params[:technology]
          @projects = scope.visible.order('lft').all
        else
          @projects = Project.get_project_based_on_priority_and_type(params[:priority], params[:type], params[:technology])
        end
        #redirect_to :back if params[:priority]
      }
      format.api  {
        @offset, @limit = api_offset_and_limit
        @project_count = Project.visible.count
        @projects = Project.visible.offset(@offset).limit(@limit).order('lft').all

SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."type" IN ('IssueCustomField') ORDER BY custom_fields.position ASC
SELECT "trackers".* FROM "trackers" ORDER BY trackers.position ASC
---
  def new
    @issue_custom_fields = IssueCustomField.sorted.all
    @trackers = Tracker.sorted.all

SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."type" IN ('IssueCustomField') ORDER BY custom_fields.position ASC
SELECT "trackers".* FROM "trackers" ORDER BY trackers.position ASC
INSERT INTO "projects" ("created_on", "description", "homepage", "identifier", "inherit_members", "is_public", "lft", "name", "parent_id", "rgt", "status", "updated_on") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
---
  def create
    @issue_custom_fields = IssueCustomField.sorted.all
    @trackers = Tracker.sorted.all
    @project = Project.new
    @project.safe_attributes = params[:project]

    if validate_parent_id && @project.save
      @project.set_allowed_parent!(params[:project]['parent_id']) if params[:project].has_key?('parent_id')
      # Add current user as a project member if current user is not admin
      unless User.current.admin?
        r = Role.givable.find_by_id(Setting.new_project_user_role_id.to_i) || Role.givable.first

SELECT "users".* FROM "users" WHERE "users"."type" IN ('GroupNonMember') ORDER BY id LIMIT 1
SELECT "news".* FROM "news" WHERE "news"."project_id" = 1 ORDER BY news.created_on DESC LIMIT 5
---
  def show
    # try to redirect to the requested menu item
    if params[:jump] && redirect_to_project_menu_item(@project, params[:jump])
      return
    end

    @users_by_role = @project.users_by_role
    @subprojects = @project.children.visible.all
    @news = @project.news.limit(5).includes(:author, :project).reorder("#{News.table_name}.created_on DESC").all

SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."type" IN ('IssueCustomField') ORDER BY custom_fields.position ASC
SELECT "trackers".* FROM "trackers" ORDER BY trackers.position ASC
---
  def settings
    @issue_custom_fields = IssueCustomField.sorted.all
    @issue_category ||= IssueCategory.new
    @member ||= @project.members.new
    @trackers = Tracker.sorted.all